/*Оконные функции
1. Напишите запрос с временной таблицей и перепишите его с табличной переменной. Сравните планы.
В качестве запроса с временной таблицей и табличной переменной можно взять свой запрос или следующий запрос:
Сделать расчет суммы продаж нарастающим итогом по месяцам с 2015 года (в рамках одного месяца он будет одинаковый, нарастать будет в течение времени выборки)
Выведите id продажи, название клиента, дату продажи, сумму продажи, сумму нарастающим итогом
Пример
Дата продажи Нарастающий итог по месяцу
2015-01-29 4801725.31
2015-01-30 4801725.31
2015-01-31 4801725.31
2015-02-01 9626342.98
2015-02-02 9626342.98
2015-02-03 9626342.98
Продажи можно взять из таблицы Invoices.
Нарастающий итог должен быть без оконной функции. */

USE WideWorldImporters;

Select I.InvoiceDate, SUM(IL.ExtendedPrice)
FROM Sales.Invoices I JOIN Sales.InvoiceLines IL
	ON I.InvoiceID = IL.InvoiceID
GROUP BY I.InvoiceDate,IL.ExtendedPrice
ORDER BY I.InvoiceDate;

/*2. Если вы брали предложенный выше запрос, то сделайте расчет суммы нарастающим итогом с помощью оконной функции.
Сравните 2 варианта запроса - через windows function и без них. Написать какой быстрее выполняется, сравнить по set statistics time on;
*/
USE WideWorldImporters;
SELECT DISTINCT I.InvoiceDate, SUM (IL.ExtendedPrice) OVER (PARTITION BY I.InvoiceDate) AS Total
FROM Sales.Invoices I JOIN Sales.InvoiceLines IL
	ON I.InvoiceID = IL.InvoiceID
GROUP BY I.InvoiceDate,IL.ExtendedPrice
ORDER BY I.InvoiceDate;

--2. Вывести список 2х самых популярных продуктов (по кол-ву проданных) в каждом месяце за 2016й год (по 2 самых популярных продукта в каждом месяце)
USE WideWorldImporters;

DROP TABLE IF EXISTS #Temp2;

SELECT  MONTH(I.InvoiceDate) AS [Month], IL.StockItemID, SUM(IL.Quantity) AS QTYY, IL.Description AS DESCR, ROW_NUMBER () OVER (ORDER BY IL.StockItemID) AS RNK
INTO #Temp2
FROM Sales.Invoices I JOIN Sales.InvoiceLines IL
	ON I.InvoiceID = IL.InvoiceID
WHERE YEAR(I.InvoiceDate) = 2016  --AND IL.StockItemID IN (2,5,8)
GROUP BY I.InvoiceDate,IL.StockItemID,IL.Quantity,IL.Description
ORDER BY I.InvoiceDate,IL.StockItemID ;

Select * from #Temp2
where RNK IN (2)
GROUP BY [Month],StockItemID,QTYY,DESCR,RNK;




/**
3. Функции одним запросом
Посчитайте по таблице товаров, в вывод также должен попасть ид товара, название, брэнд и цена
пронумеруйте записи по названию товара, так чтобы при изменении буквы алфавита нумерация начиналась заново
посчитайте общее количество товаров и выведете полем в этом же запросе
посчитайте общее количество товаров в зависимости от первой буквы названия товара
отобразите следующий id товара исходя из того, что порядок отображения товаров по имени
предыдущий ид товара с тем же порядком отображения (по имени)
названия товара 2 строки назад, в случае если предыдущей строки нет нужно вывести "No items"
сформируйте 30 групп товаров по полю вес товара на 1 шт
Для этой задачи НЕ нужно писать аналог без аналитических функций
4. По каждому сотруднику выведите последнего клиента, которому сотрудник что-то продал
В результатах должны быть ид и фамилия сотрудника, ид и название клиента, дата продажи, сумму сделки
5. Выберите по каждому клиенту 2 самых дорогих товара, которые он покупал
В результатах должно быть ид клиета, его название, ид товара, цена, дата покупки

Опционально можно сделать вариант запросов для заданий 2,4,5 без использования windows function и сравнить скорость как в задании 1.

Bonus из предыдущей темы
Напишите запрос, который выбирает 10 клиентов, которые сделали больше 30 заказов и последний заказ был не позднее апреля 2016.
Критерии оценки: 3 задание сдано и есть замечания, которые студент не хочет исправлять
+1 балл замечаний нет либо они исправлены
+1 балл ДЗ сдано в течение 1 недели с момента занятия